README correction
